Repository: voikko/joukahainen
Catalog: langpacks/*/messages.po
Languages: fi

source: Parameter %s is required
fi: Parametri %s on pakollinen

source: Word %i does not exist
fi: Sanaa %i ei ole olemassa

source: Only POST requests are allowed
fi: Vain POST-pyynnöt ovat sallittuja

source: You are not allowed to edit data
fi: Sinulla ei ole oikeutta tietojen muuttamiseen

source: (None)
fi: (Ei mitään)

source: Word
fi: Sana

source: flags
fi: liput

source: Only GET and POST requests are allowed
fi: Vain GET- ja POST-pyynnöt ovat sallittuja

source: Flag removed: '%s'
fi: Lippu poistettu: '%s'

source: Flag added: '%s'
fi: Lippu lisätty: '%s'

source: related words
fi: kirjoitusasut

source: Alternative spelling removed: '%s'
fi: Kirjoitusasu poistettu: '%s'

source: Alternative spelling added: '%s'
fi: Kirjoitusasu lisätty: '%s'

source: reject
fi: hylkää

source: Homonyms
fi: Homonyymit

source: Forbidden characters in the word
fi: Sanassa on kiellettyjä merkkejä

source: Word class must be set
fi: Sanaluokka on asetettava

source: Word added
fi: Sana lisätty

source: Word removed from the list of candidate words
fi: Sana poistettu ehdotettujen sanojen listalta

source: Nothing was done
fi: Mitään ei tehty

source: Only GET requests are allowed
fi: Vain GET-pyynnöt ovat sallittuja

source: There are no words to be added
fi: Lisäystä odottavia sanoja ei ole

source: in category %s
fi: kategoriassa %s

source: Add words
fi: Lisää sanoja

source: Word class
fi: Sanaluokka

source: Notes
fi: Huomioita

source: Word was not added
fi: Sanaa ei lisätty

source: Adding some words failed or requires confirmation. Make the required changes and mark the words that you still want to add.
fi: Joidenkin sanojen lisäys ei onnistunut tai vaatii vahvistuksen. Tee tarvittavat korjaukset ja merkitse sanat, jotka edelleen haluat lisättäviksi.

source: Confirm addition
fi: Vahvista lisäys

source: Continue
fi: Jatka

source: The following changes were made
fi: Seuraavat muutokset tehtiin

source: Back to main page
fi: Takaisin aloitussivulle

source: Choose a category from which you want to add words
fi: Valitse kategoria, josta haluat lisätä sanoja

source: Category
fi: Kategoria

source: Words left
fi: Sanoja jäljellä

source: no category
fi: ei kategoriaa

source: All words
fi: Kaikki sanat

source: Missing or incorrect username or password
fi: Käyttäjätunnus tai salasana on väärin tai puuttuu

source: Incorrect username or password
fi: Käyttäjätunnus tai salasana on väärin

source: Only administrator logins are allowed at the moment
fi: Kirjautuminen on sallittu tällä hetkellä vain pääkäyttäjälle

source: You must be an administrator to do this
fi: Tämä toiminto vaatii pääkäyttäjän oikeudet

source: Add user
fi: Lisää käyttäjä

source: First name
fi: Etunimi

source: Last name
fi: Sukunimi

source: Username
fi: Käyttäjätunnus

source: Email address
fi: Sähköpostiosoite

source: Password
fi: Salasana

source: Required field %s is missing
fi: Pakollinen kenttä %s puuttuu

source: User name is already in use
fi: Käyttäjänimi on jo käytössä

source: New user was added succesfully
fi: Uuden käyttäjän lisäys onnistui

source: You must be logged in to do this
fi: Tämä toiminto toimii vain kirjautuneilla käyttäjillä

source: Change password
fi: Vaihda salasana

source: Old password
fi: Vanha salasana

source: New password
fi: Uusi salasana

source: Required field is missing
fi: Pakollinen kenttä puuttuu

source: Incorrect old password
fi: Vanha salasana on väärin

source: Password was changed succesfully
fi: Salasanan vaihto onnistui

source: There are no tasks.
fi: Tehtäviä ei ole

source: tasks
fi: tehtävät

source: Choose a task
fi: Valitse tehtävä

source: Task
fi: Tehtävä

source: Total words
fi: Sanoja yhteensä

source: Completed
fi: Valmiina

source: Number of words left is an estimate
fi: Jäljellä olevien sanojen määrä on arvio

source: task
fi: tehtävä

source: Save checked
fi: Tallenna tarkistetut

source: Search database
fi: Hae tietokannasta

source: Use regular expression
fi: Käytä säännöllistä lauseketta

source: Text attributes
fi: Tekstikentät

source: select attribute
fi: valitse attribuutti

source: is
fi: on

source: Flags set
fi: Asetetut liput

source: Flags not set
fi: Pois päältä olevat liput

source: Output type
fi: Tulosteen tyyppi

source: Search
fi: Hae

source: Reset
fi: Tyhjennä

source: Word has forbidden characters in it
fi: Sanassa on kiellettyjä merkkejä

source: List changes
fi: Listaa muutokset

source: Invalid start date
fi: Virheellinen aloituspäivä

source: Invalid end date
fi: Virheellinen lopetuspäivä

source: Start date
fi: Aloituspäivä

source: End date
fi: Lopetuspäivä

source: Word created
fi: Sana lisätty

source: Too many changes, use narrower date interval.
fi: Liian paljon muutoksia, käytä lyhyempää aikaväliä.

source: Inflections are not available for this language
fi: Taivutustietoja ei ole saatavilla tälle kielelle

source: Kotus class is not available for this language
fi: Kotus-sanaluokkaa ei ole saatavilla tälle kielelle

source: No matching words were found
fi: Hakua vastaavia sanoja ei löytynyt

source: Search results
fi: Hakutulokset

source: More results
fi: Lisää tuloksia

source: Output as page with links
fi: Tulosta linkkilistana

source: Error: unknown module
fi: Virhe: tuntematon moduuli

source: Error: word class %i does not exist
fi: Virhe: sanaluokkaa %i ei ole olemassa

source: No flags set
fi: Ei asetettuja lippuja

source: Not set
fi: Ei asetettu

source: Add a comment
fi: Lisää kommentti

source: Save changes
fi: Tallenna muutokset

source: Cancel changes
fi: Peruuta muutokset

source: No flags available
fi: Lippuja ei ole olemassa

source: Remove alternative forms
fi: Poista kirjoitusasuja

source: Add alternative forms
fi: Lisää kirjoitusasuja

source: Word in Wiki
fi: Sana Wikissä

source: Error: 1 parameter expected
fi: Virhe: tarvitaan 1 parametri

source: Error: %i parameters expected
fi: Virhe: tarvitaan %i parametriä

source: Find inflection class...
fi: Etsi taivutusluokka...

source: Error: unknown function
fi: Virhe: tuntematon funktio

source: Log in
fi: Kirjaudu sisään

source: Log out user
fi: Kirjaa ulos käyttäjä

source: Error: % parameters expected
fi: Virhe: tarvitaan %i parametriä

source: Redirecting to %s
fi: Uudelleenohjataan osoitteeseen %s

source: error
fi: virhe

source: Error
fi: Virhe

source: operation succeeded
fi: toiminto suoritettu

source: Back to front page
fi: Takaisin aloitussivulle
